{
  "name": "Mushfiq Mahmud",
  "socials": {
    "email": "mushfiq8194@gmail.com",
    "location": "Tampa, FL",
    "phone": "813-570-1426",
    "linkedIn": "mushfiq-mahmud",
    "github": "mushfiq814",
    "website": "mushfiqmahmud.com"
  },
  "objective": "Software Developer with professional experience in NodeJS, TypeScript, JavaScript, React, PHP and SQL.",
  "education": [
    {
      "school": "University of South Florida (USF)",
      "location": "Tampa, FL",
      "graduation": "May 2022",
      "degree": "Master of Science in Computer Science",
      "gpa": "GPA: 3.6",
      "bullets": [
        "Major Coursework: Adv. Databases, Image Processing, Compilers, Operating Systems, Algorithms, Computer Architecture.",
        "Achievements: Honors College, Honors Scholarship, Phi Kappa Phi Honors Society Member, Undergraduate Research."
      ]
    }
  ],
  "experience": [
    {
      "position": "Senior Software Engineer",
      "company": "Achieve",
      "location": "Phoenix, AZ (Remote)",
      "start": "Sep 2022",
      "end": "Present",
      "bullets": []
    },
    {
      "position": "Full Stack Engineer",
      "company": "Everest LLC",
      "location": "Tampa, FL",
      "start": "Oct 2021",
      "end": "Sep 2022",
      "bullets": [
        "Modernize Legacy monolithic loan application into 4 separate microservices for a large financial company spanning back end and front end to integrate with legacy codebase working closely with internal teams following Agile methods.",
        "Worked with Product and Design team as well as a dev team of 12-20 people to complete assigned issues under strict deadlines and outstanding communication skills using productivity and communication tools such as Jira, Slack.",
        "Utilized software collaboration tools/patterns such as BitBucket, Git Flow, constant Code Reviews, Retrospectives, demos/lunch & learns  and Documentation on Confluence to produce professional and readable code with a leading edge web stack consisting of JavaScript, ReactJS, NextJS, Apollo GraphQL, ExpressJS, Webpack and a mobile first design view.",
        "Collaborated with QA teams every sprint for automation and integration testing as well as writing unit tests using Jest, React Testing Library and tools such as Postman and Storybook.",
        "Spearheaded complete DocuSign contract generation flow using advanced postman tooling such as GraphQL schema automation & scripting to chain multiple scripts using the collection runner reducing manual application for team members.",
        "Participated in extensive training with Contentful to learn to utilize their SDK and APIs for ecommerce.",
        "Create a modern web app MVP for Design System collaboration including integrations with Figma, Loom and Slack APIs.",
        "Build out UI design library from Figma designs with component reusability, accessibility and UX in mind, regular demos/showcases, prioritizing feature delivery within 3 months while having clean code.",
        "Collaborate with developers using GitHub flow, Code Reviews, Pair Programming, Issue Tracking and robust CI/CD pipelines using tools and technologies including TypeScript, ReactJS, TailwindCSS, Remix, Prisma, PostgreSQL, React-aria, and Vite.",
        "Constant testing with Vitest, Cypress E2E testing, React Testing Library, Storybook snapshots and Unit Testing."
      ]
    },
    {
      "position": "Full Stack Web Developer",
      "company": "Disciplined Minds Tutoring LLC",
      "location": "Tampa, FL",
      "start": "Dec 2017",
      "end": "Sep 2021",
      "bullets": [
        "Reduced 20 man-hours per week developing mission critical application to automate day-to-day administrative tasks.",
        "Saved costs by 60% by building in house application using Apple FileMaker involving database schema design & modelling, Join Tables to connect many-to-many relationships and automating payments via Authorize.net API.",
        "Handled tens of thousands of records spread across around 100 tables amidst an ever-growing customer base and implementing database changes for an improved online booking experience during the 2020 coronavirus pandemic.",
        "Wrote FileMaker scripts to automate recurring procedures and manage workflows used by around 35-50 people daily and schedule regular scripts to run reports for the management team via email and perform payroll time-sheet calculation.",
        "Created and maintain security groups to organize data access to different levels of both employees and customers.",
        "Optimized and recommended database and script modifications to improve runtime efficiency and performance.",
        "Lead educational sessions for team members as a subject matter expert (SME) for FileMaker and Web Technologies.",
        "Assisted in entire system transition from proprietary server software (FileMaker Server) to AWS EC2, S3 for storage and Route 53 for DNS including backup systems via batch scripts, setting up remote desktop connections and maintaining event logs.",
        "Set up On-Demand server side LaTeX compilation to PDF on AWS server with ability to preview snippets in PNG for quicker compilations. This allowed tutors to generate testing questions for students from a wide assortment from any device.",
        "Increased remote work opportunities by creating a responsive browser version of our main FileMaker application to help employees work from home providing functionality to sign for sessions, write notes and maintain appointment schedules.",
        "Built a Middleware API in PHP with multiple data end points providing access to information such as availability of employees for booking appointments based on existing booked sessions and calendar blocks and retrieving subject availability per tutor. This helped reduce tens of hours every week by facilitating performing queries to find available employees.",
        "Integrated with 3rd party public APIs such as Google Calendar, Gmail and FileMaker APIs via PHP JSON parsing libraries.",
        "Maintained and scaled Middleware API adhering to RESTful design patterns while keeping minimal code complexity.",
        "Managed oAuth flow using access codes and refresh tokens when adding new employee calendars to main application.",
        "Developed one way sync of Google Calendar with hosted database mapping calendar event IDs to local lesson IDs supporting both single and recurring series of events with implementations for recurrence rules.",
        "Implemented manual datetime conversion between FileMaker timestamps and ISO-8601 date format including daylight savings calculations since no well known library for dealing with datetime exists in FileMaker.",
        "Built Booking Site initially with TypeScript/WebPack using npm and NodeJS, and later with React for improved scalability.",
        "Made incremental changes over a few months through feedback from management team as well as customer reviews.",
        "Made use of React functional components, hooks, React Router, MVC framework, Context API, component libraries (react datepickers), SCSS, Bootstrap & styled components to offer smooth functionality for clients to book online appointments.",
        "Developed and maintained WordPress website using PHP, HTML5, CSS3, JavaScript, and MySQL working regularly with FTP Clients & SSH to update and maintain files on the server redesigning several preexisting pages by creating mockups using Inkscape/Gimp and implement using CSS flexbox and Grid to make them responsive to various screen sizes.",
        "Lead migration of Managed WordPress from old server to Digital Ocean Droplet with DNS management and backups.",
        "Presented new features to main business FileMaker applications at work meeting to staff."
      ]
    }
  ],
  "projects": [
    "Create a compiler from scratch for a Java-like Object Oriented language into Assembly using C without libraries.",
    "Implement PostgreSQL custom aggregates and functions by modifying source code as well as using PL/SQL.",
    {
      "template": "Create single page application in Angular8 using YouTube API to browse and watch videos ($).",
      "delimeter": "$",
      "links": [
        {
          "href": "https://github.com/mushfiq814/youtube-data-api-dogVids",
          "text": "link"
        }
      ]
    },
    {
      "template": "More projects on my $ and $.",
      "delimeter": "$",
      "links": [
        {
          "href": "https://mushfiqmahmud.com/html/projects",
          "text": "website"
        },
        {
          "href": "https://github.com/mushfiq814",
          "text": "github"
        }
      ]
    },
    "Use OpenCV and custom-made C++ functions to perform basic image processing analysis including object tracking, edge detectors, histogram stretching and preprocessing functions such as Gaussian blurring, filtering, etc.",
    "Create cross-platform Android and iOS reddit application with Flutter that uses the reddit API and oAuth."
  ]
}
